Repository: SamuelSwartzberg/scripts
Catalog: sh/omega-init/project/tm/2019-10-28-ÜbersetzungJETBELT-omegat.tmx
Source language: de_de
Languages: en_us

source: Anschließen werden wir in mehreren Make Offs die Arbeitsweise veranschaulichen, so zu sagen ein Blick hinter die Kulissen gewähren, das schafft Vertrauen und der Kunde weiss dass er in den besten Händen ist.
en_us: Each sample will be accompanied by a making-of, to give you a behind-the-scenes look at our manufacturing process and showcase our talented team. This way you can be sure you are in the best of hands!

source: Aus dem 3-D-Modell wird dann ein Prototyp im 3-D-Druck erstellt und anschließend im gewünschten Material gegossen.
en_us: After 3-D printing a prototype, the buckle then will be cast in the chosen material.

source: Danach wird der Verschluss von Kevin Barnes in der gewünschten Weise (verschiedene Oberflächen und Strukturen, Edelsteine, Brillianten etc.) veredelt.
en_us: Finally, Kevin Barnes will adorn the buckle with the chosen textures, jewels or gemstones.

source: Der Kunde entscheidet was er haben möchte und wählt ein Thema aus.
en_us: Once you have decided on your ideal material, it's time to choose which motif will adorn your JET BELT®.

source: Der exklusive Gürtel von JET BELT®, der auf höchstem Niveau gefertigt wird soll damit auch den Kundenkreis erschließen, der nicht nur die Qualität und die Funktion des JET BELT® genießen möchte, sondern auch Wert auf einen exklusiven nur für ihn angefertigten Verschluss legt.
en_us: We know that you, the discerning customer, often not only value the high quality and seamless functionality of the JET BELT®, but also a completely unique buckle, personally chosen by you to fit your inimitable personal style.

source: Der exklusive Kunde erhält dann einen Verschluss zu seinem JET BELT® der weltweit einzigartig ist und den Stil des Kunden auf der handwerklich höchsten Stufe individualisiert - mehr geht nicht!
en_us: The final product is a JET BELT® that is truly one of a kind, a belt buckle that has via superior workmanship achieved an elegance that is both unique and matchless.

source: Die dafür verwendeten Materialien unterscheiden sich hier deutlich von dem bisherigen Materail beschichteter Zinkdruckguss.
en_us: To begin with, we have selected a variety of materials to choose from:

source: Hier bekommt er Vorschläge in Form von 3-D- konstruierten Bildern die dem echten Produkt täuschend ähnlich sind die dann zu einem Lösungsvorschlag führen.
en_us: You will then receive 3-D mock-ups of the final product, allowing you to preview the belt, exercise your taste and suggest any modifications you require for the belt to be exactly as you imagine it.

source: JET BELT® Andreas Felger München und der Schmuckdesigner Kevin Barnes ("https://edelundmetall.com/“) aus München starten Zusammenarbeit.
en_us: JET BELT® by Andreas Felger and Munich-based jewelry designer Kevin Barnes ( "https://edelundmetall.com/") launch collaboration!

source: Wir werden in den nächsten Wochen Beispiele dieser Individualisierung aufzeigen, damit es besser vorstellbar ist was möglich ist und auf welchem Niveau wir arbeiten.
en_us: Stay tuned as we feature different samples of this personalization in the following weeks - be ready to be amazed at our workmanship and the possibilities available.

source: Ziel dieser Zusammenarbeit ist es, die Verschlüsse von JET BELT® auf dem höchsten Niveau für den anspruchsvollen Kunden zu individualisieren.
en_us: Enabling the sophisticated customer to customize the JET BELT® buckle with elegant designs and superior materials - this is the challenge that JET BELT® and Kevin Barnes aim to meet.

source: Zur Auswahl stehen Eisen, Edelstahl, Silber, Gold und auch Platin.
en_us: iron, stainless steel, silver, gold, and even platinum.
